DELETE FROM store_feature;
DELETE FROM room;
DELETE FROM store;

-- store_feature 데이터 삽입
INSERT INTO store_feature (store_feature_id, is_small_dog, is_medium_dog, is_large_dog, is_parking, is_dog_park, is_dog_swimming_pool, is_internet, is_barbecue, is_toilet_division, is_food_packing, is_waiting_place, is_kid_seat)
VALUES
    (1, true, true, true, false, false, false, true, false, true, true, false, true),
    (2, true, true, true, false, false, false, true, false, true, true, false, true),
    (3, true, true, true, false, false, false, true, false, false, true, false, true),
    (4, true, true, false, false, false, false, true, false, false, true, false, false),
    (5, true, true, true, false, false, false, true, false, true, true, false, true),
    (6, true, true, true, true, false, false, true, false, true, true, true, false),
    (7, true, true, true, false, false, false, true, false, true, false, false, false),
    (8, true, true, false, true, false, false, true, false, false, true, false, false),
    (9, true, true, true, true, false, false, true, false, true, true, false, true),
    (10, true, true, true, false, false, false, true, false, false, false, false, false),
    (11, true, true, true, true, false, false, true, false, true, true, false, false),
    (12, true, true, true, false, false, false, true, false, true, true, false, false),
    (13, true, true, true, false, false, false, true, false, true, true, false, false),
    (14, true, true, true, false, true, false, true, false, true, true, false, false),
    (15, true, true, true, false, false, false, true, false, false, true, false, true);

-- store 데이터 삽입
INSERT INTO store (store_id, store_name, store_tel, store_location, store_point, store_president_name, store_category, rating, review_count, pet_guide, use_guide, store_feature_id)
VALUES
    (1, '료미', '054-624-5060', '경북 경주시 포석로 1058-1 료미', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EAF37AE172A1406026B6DCA88CFC', NULL, 'RESTAURANT', 0.0, 0, '공간 착석 가능(야외)', '주차장이 없으므로 인근 주차장 이용 부탁드립니다.', 1),
    (2, '여정1998', '0507-1321-1784', '경북 경주시 용황로4길 3-44 1층', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041F0DBE0D1669040602725512810C0', NULL, 'RESTAURANT', 0.0, 0, '- 리드줄 착용필수(마킹, 배변 금지)\n- 유모차, 케이지 지참 권장', '전용주차장 구비 완료', 2),
    (3, '오늘을 담다', '0507-1339-3906', '경북 경주시 북정로 12 1층', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EBC87EF4D2A5406026E4ABA0D827', NULL, 'RESTAURANT', 0.0, 0, '- 맹견 및 짖음이 심한 경우 이용불가\n- 리드줄 착용필수 (이동가방, 개모차)\n- 내부에서 돌아다니지 않도록 권고',  '주차장이 없으므로 인근 주차장 이용 부탁드립니다.', 3),
    (4, '줄리스', '054-705-5705', '경북 경주시 손효자길 20', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EB3B420AE765406026BC7F134A4E', NULL, 'RESTAURANT', 0.0, 0, '- 가방, 유모차 이용\n- 공격성이나 짖음이 있을 시 이용불가', '주차장이 없으므로 인근 주차장 이용 부탁드립니다.', 4),
    (5, '황남두꺼비식당 황남본점', '0507-1375-8026', '경북 경주시 포석로1050번길 16 두꺼비식당', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EAD0A59F615A406026BFD5022574', NULL, 'RESTAURANT', 0.0, 0, '- 짖음이 심할 경우 야외 이용 권고\n- 리드줄 착용 및 펫티켓 필수', '주차장이 없으므로 인근 주차장 이용 부탁드립니다.', 5),
    (6, '계림주막', '0507-1360-7442', '경북 경주시 포석로1050번길 23-9 계림주막', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EADF4A685905406026C85751F66D', NULL, 'RESTAURANT', 0.0, 0, '- 리드줄 착용필수\n- 짖음이 심할 경우 보호자 케어 필수', '가게 앞 무료주차 가능', 6),
    (7, '손가맥집', '0507-0000-0000', '경북 경주시 첨성로81번길 22-15', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EAE344887027406026CB044000A1', NULL, 'RESTAURANT', 0.0, 0, '공간착석가능(1층 야외)', '주차장이 없으므로 인근 주차장 이용 부탁드립니다.', 7),
    (8, '삐또레', '0507-1334-7422', '경북 경주시 용담로92번길 11-2 유원아파트 상가 삐또레', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EEB98115943C406026CA05722FC8', NULL, 'CAFE', 0.0, 0, '- 동반착석시 보호자가 안고 있기를 권장\n- 매너벨트 착용 권고', '가게 앞 무료주차 가능', 8),
    (9, '르씨엘', '0507-1312-6938', '경북 경주시 석장동 1174', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A40060200024400017844000179787040401C538EF34D6A402839652BD3C369', NULL, 'CAFE', 0.0, 0, '- 맹견의 경우 입마개 필수\n- 리드줄 필수', '전용 주차장 구비 완료', 9),
    (10, '서점 북미', '0507-1331-7840', '경북 경주시 북성로 103-1 2층', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EC79AB67A251406026E4ABB0F352', NULL, 'CAFE', 0.0, 0, '- 사납거나 짖음이 있을 경우 출입 제한\n- 실내마킹 견은 매너벨트 착용 필수', '주차장이 없으므로 인근 주차장 이용 부탁드립니다.', 10),
    (11, '오버랩', '0507-1397-1374', '경북 경주시 금성로247번길 8 1층 오버랩', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EB7F27E8D23C40602699E1BDF599', NULL, 'CAFE', 0.0, 0, '- 1층 실내 가능\n- 풀어놓는 거 말고 전부 가능', '가게 앞 무료주차 가능', 11),
    (12, '테를지', '054-746-7732', '경북 경주시 태종로 736 테를지', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EB6940357A35406026AD414BFAAA', NULL, 'CAFE', 0.0, 0, '- 야외석 입장가능,\n- 실내 입장시 애견백 필수', '가게 건너 무료주차장 구비', 12),
    (13, '미실카페', '0507-1349-1122', '경북 경주시 사정로57번길 19 미실', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EB48292410AB406026B2251639FE', NULL, 'CAFE', 0.0, 0, '- 리드줄 착용 필수\n- 가방 지참 권장', '주차장이 없으므로 인근 주차장 이용 부탁드립니다.', 13),
    (14, '카페솔', '0507-1428-9449', '경북 경주시 포석로1092번길 62-8 1층', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EAEF2AB02CD9406026DE7E704867', NULL, 'CAFE', 0.0, 0, '- 리드줄 착용 필수\n- 배변처리 권고',  '주차장이 없으므로 인근 주차장 이용 부탁드립니다.', 14),
    (15, '이이로', '0507-1397-8788', '경북 경주시 첨성로99번길 22 이이로커피', '\xACED0005737200226F72672E737072696E676672616D65776F726B2E646174612E67656F2E506F696E7431B9E90EF11A4006020002440001784400017978704041EAE674FF0584406026CE8137A304', NULL, 'CAFE', 0.0, 0, '- 실내외 모두 가능\n- 멍푸치노 메뉴 구비', '주차장이 없으므로 인근 주차장 이용 부탁드립니다.', 15);

-- room 데이터 삽입
-- INSERT INTO room (room_id, store_id, room_type, price_per_night, total_room_count, available_people_pets, room_description)
-- VALUES
--     (1, 16, '스탠다드 더블', 126000, 15, '기준 2인, 1마리 / 최대 3인, 1마리', '퀸 침대 1개'),
--     (2, 16, '디럭스 더블', 135000, 10, '기준 2인, 2마리 / 최대 3인, 1마리', '킹 침대 1개'),
--     (3, 16, '스탠다드 트윈', 149000, 15, '기준 2인, 1마리 / 최대 3인, 1마리', '싱글 침대 2개'),
--     (4, 17, '스탠다드 더블', 126000, 15, '기준 2인, 1마리 / 최대 3인, 1마리', '퀸 침대 1개'),
--     (5, 17, '디럭스 더블', 135000, 10, '기준 2인, 2마리 / 최대 3인, 1마리', '킹 침대 1개'),
--     (6, 17, '스탠다드 트윈', 149000, 15, '기준 2인, 1마리 / 최대 3인, 1마리', '싱글 침대 2개'),
--     (7, 18, '스탠다드 더블', 126000, 15, '기준 2인, 1마리 / 최대 3인, 1마리', '퀸 침대 1개'),
--     (8, 18, '디럭스 더블', 135000, 10, '기준 2인, 2마리 / 최대 3인, 1마리', '킹 침대 1개'),
--     (9, 18, '스탠다드 트윈', 149000, 15, '기준 2인, 1마리 / 최대 3인, 1마리', '싱글 침대 2개'),
--     (10, 19, '스탠다드 더블', 126000, 15, '기준 2인, 1마리 / 최대 3인, 1마리', '퀸 침대 1개'),
--     (11, 19, '디럭스 더블', 135000, 10, '기준 2인, 2마리 / 최대 3인, 1마리', '킹 침대 1개');